{"Romance-books-2022":[{"title":"Book Lovers","author":"Emily Henry","description":"One summer. Two rivals. A plot twist they didn't see coming....Nora Stephens’ life is books—she’s read them all—and she is not that type of heroine. Not the plucky one, not the laidback dream girl, and especially not the sweetheart. In fact, the only people Nora is a heroine for are her clients, for whom she lands enormous deals as a cutthroat literary agent, and her beloved little sister Libby.Which is why she agrees to go to Sunshine Falls, North Carolina for the month of August when Libby begs her for a sisters’ trip away—with visions of a small-town transformation for Nora, who she’s convinced needs to become the heroine in her own story. But instead of picnics in meadows, or run-ins with a handsome country doctor or bulging-forearmed bartender, Nora keeps bumping into Charlie Lastra, a bookish brooding editor from back in the city. It would be a meet-cute if not for the fact that they’ve met many times and it’s never been cute.If Nora knows she’s not an ideal heroine, Charlie knows he’s nobody’s hero, but as they are thrown together again and again—in a series of coincidences no editor worth their salt would allow—what they discover might just unravel the carefully crafted stories they’ve written about themselves.","img":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1638867089i/58690308.jpg"},{"title":"Reminders of Him","author":"Colleen Hoover","description":"After serving five years in prison for a tragic mistake, Kenna Rowan returns to the town where it all went wrong, hoping to reunite with her four-year-old daughter. But the bridges Kenna burned are proving impossible to rebuild. Everyone in her daughter’s life is determined to shut Kenna out, no matter how hard she works to prove herself.The only person who hasn’t closed the door on her completely is Ledger Ward, a local bar owner and one of the few remaining links to Kenna’s daughter. But if anyone were to discover how Ledger is slowly becoming an important part of Kenna’s life, both would risk losing the trust of everyone important to them.The two form a connection despite the pressure surrounding them, but as their romance grows, so does the risk. Kenna must find a way to absolve the mistakes of her past in order to build a future out of hope and healing.A troubled young mother yearns for a shot at redemption in this heartbreaking yet hopeful story from #1 New York Times bestselling author Colleen Hoover.","img":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1627673847i/58346977.jpg"},{"title":"It Starts with Us","author":"Colleen Hoover","description":"Before It Ends with Us, it started with Atlas. Colleen Hoover tells fan favorite Atlas’s side of the story and shares what comes next in this long-anticipated sequel to the “glorious and touching” (USA TODAY) #1 New York Times bestseller It Ends with Us. Lily and her ex-husband, Ryle, have just settled into a civil coparenting rhythm when she suddenly bumps into her first love, Atlas, again. After nearly two years separated, she is elated that for once, time is on their side, and she immediately says yes when Atlas asks her on a date.But her excitement is quickly hampered by the knowledge that, though they are no longer married, Ryle is still very much a part of her life—and Atlas Corrigan is the one man he will hate being in his ex-wife and daughter’s life.Switching between the perspectives of Lily and Atlas, It Starts with Us picks up right where the epilogue for the “gripping, pulse-pounding” (Sarah Pekkanen, author of Perfect Neighbors) bestselling phenomenon It Ends with Us left off. Revealing more about Atlas’s past and following Lily as she embraces a second chance at true love while navigating a jealous ex-husband, it proves that “no one delivers an emotional read like Colleen Hoover” (Anna Todd, New York Times bestselling author).","img":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1644605295i/60393672.jpg"},{"title":"Love on the Brain","author":"Ali Hazelwood","description":"A STEMinist rom-com in which a scientist is forced to work on a project with her nemesis--with explosive results.Like an avenging, purple-haired Jedi bringing balance to the mansplained universe, Bee Königswasser lives by a simple code: What would Marie Curie do? If NASA offered her the lead on a neuroengineering project--a literal dream come true after years scraping by on the crumbs of academia--Marie would accept without hesitation. Duh. But the mother of modern physics never had to co-lead with Levi Ward.Sure, Levi is attractive in a tall, dark, and piercing-eyes kind of way. And sure, he caught her in his powerfully corded arms like a romance novel hero when she accidentally damseled in distress on her first day in the lab. But Levi made his feelings toward Bee very clear in grad school--archenemies work best employed in their own galaxies far, far away.Now, her equipment is missing, the staff is ignoring her, and Bee finds her floundering career in somewhat of a pickle. Perhaps it's her occipital cortex playing tricks on her, but Bee could swear she can see Levi softening into an ally, backing her plays, seconding her ideas...devouring her with those eyes. And the possibilities have all her neurons firing. But when it comes time to actually make a move and put her heart on the line, there's only one question that matters: What will Bee Königswasser do?","img":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1642118320i/59856881.jpg"},{"title":"Every Summer After","author":"Carley Fortune","description":"They say you can never go home again, and for Persephone Fraser, ever since she made the biggest mistake of her life a decade ago, that has felt too true. Instead of glittering summers on the lakeshore of her childhood, she spends them in a stylish apartment in the city, going out with friends, and keeping everyone a safe distance from her heart.Until she receives the call that sends her racing back to Barry’s Bay and into the orbit of Sam Florek—the man she never thought she’d have to live without.For six summers, through hazy afternoons on the water and warm summer nights working in his family’s restaurant and curling up together with books—medical textbooks for him and work-in-progress horror short stories for her—Percy and Sam had been inseparable. Eventually that friendship turned into something breathtakingly more, before it fell spectacularly apart. When Percy returns to the lake for Sam’s mother’s funeral, their connection is as undeniable as it had always been. But until Percy can confront the decisions she made and the years she’s spent punishing herself for them, they’ll never know whether their love might be bigger than the biggest mistakes of their past. Told over the course of six years and one weekend, Every Summer After is a big, sweeping nostalgic look at love and the people and choices that mark us forever.Six summers to fall in love. One moment to fall apart. A weekend to get it right.","img":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1630101647i/58014893.jpg"},{"title":"Things We Never Got Over","author":"Lucy Score","description":"Bearded, bad-boy barber Knox prefers to live his life the way he takes his coffee: Alone. Unless you count his basset hound, Waylon. Knox doesn’t tolerate drama, even when it comes in the form of a stranded runaway bride.Naomi wasn’t just running away from her wedding. She was riding to the rescue of her estranged twin to Knockemout, Virginia, a rough-around-the-edges town where disputes are settled the old-fashioned way… with fists and beer. Usually in that order.Too bad for Naomi her evil twin hasn’t changed at all. After helping herself to Naomi’s car and cash, Tina leaves her with something unexpected. The niece Naomi didn’t know she had. Now she’s stuck in town with no car, no job, no plan, and no home with an 11-year-old going on thirty to take care of.There’s a reason Knox doesn’t do complications or high-maintenance women, especially not the romantic ones. But since Naomi’s life imploded right in front of him, the least he can do is help her out of her jam. And just as soon as she stops getting into new trouble he can leave her alone and get back to his peaceful, solitary life.At least, that’s the plan until the trouble turns to real danger.","img":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1669676108i/60156155.jpg"},{"title":"Delilah Green Doesn't Care","author":"Ashley Herring Blake","description":"A clever and steamy queer romantic comedy about taking chances and accepting love—with all its complications—by debut author Ashley Herring Blake.Delilah Green swore she would never go back to Bright Falls—nothing is there for her but memories of a lonely childhood where she was little more than a burden to her cold and distant stepfamily. Her life is in New York, with her photography career finally gaining steam and her bed never empty. Sure, it’s a different woman every night, but that’s just fine with her.When Delilah’s estranged stepsister, Astrid, pressures her into photographing her wedding with a guilt trip and a five-figure check, Delilah finds herself back in the godforsaken town that she used to call home. She plans to breeze in and out, but then she sees Claire Sutherland, one of Astrid’s stuck-up besties, and decides that maybe there’s some fun (and a little retribution) to be had in Bright Falls, after all.Having raised her eleven-year-old daughter mostly on her own while dealing with her unreliable ex and running a bookstore, Claire Sutherland depends upon a life without surprises. And Delilah Green is an unwelcome surprise…at first. Though they’ve known each other for years, they don’t really know each other—so Claire is unsettled when Delilah figures out exactly what buttons to push. When they’re forced together during a gauntlet of wedding preparations—including a plot to save Astrid from her horrible fiancé—Claire isn’t sure she has the strength to resist Delilah’s charms. Even worse, she’s starting to think she doesn’t want to…","img":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1643753957i/54756850.jpg"},{"title":"Twisted Hate","author":"Ana Huang","description":"Gorgeous, cocky, and fast on his way to becoming a hotshot doctor, Josh Chen has never met a woman he couldn’t charm—except for Jules f**king Ambrose.The beautiful redhead has been a thorn in his side since they met, but she also consumes his thoughts in a way no woman ever has.When their animosity explodes into one unforgettable night, he proposes a solution that’ll get her out of his system once and for all: an enemies with benefits arrangement with simple rules.No jealousy.No strings attached.And absolutely no falling in love.**Outgoing and ambitious, Jules Ambrose is a former party girl who’s focused on one thing: passing the attorney’s bar exam.The last thing she needs is to get involved with a doctor who puts the SUFFER in insufferable… no matter how good-looking he is.But the more she gets to know him, the more she realizes there’s more than meets the eye to the man she’s hated for so long.Her best friend’s brother.Her nemesis.And her only salvation.Theirs is a match made in hell, and when the demons from their past catch up with them, they’re faced with truths that could either save them… or destroy everything they’ve worked for.Twisted Hate is a steamy enemies with benefits/enemies to lovers romance. It's book three in the Twisted series but can be read as a standalone.Warning: It contains explicit content and profanity. Recommended for 18+.","img":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1661221520i/62056935.jpg"},{"title":"Terms and Conditions","author":"Lauren Asher","description":"DeclanI’m destined to become the next CEO of my family’s media empire. The only problem? My grandfather’s inheritance clause. Fulfilling his dying wish of getting married and having an heir seemed impossible until my assistant volunteers for the job. Our marriage was supposed to be the perfect solution to my biggest problem. But the more we act in love for the public, the more unsure I feel about our contract. Caring about Iris was never part of the deal. Especially not when breaking her heart is inevitable. IrisMy plan to marry Declan was simple in theory. Move in together. Throw a wedding. Have a baby. We set rules to prevent any kind of issues. Ones that were never meant to be broken, no matter how much Declan tempts me. But what happens when our fake relationship bleeds into our real one? Falling in love was never an option. At least not for me.","img":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1645560667i/60476301.jpg"},{"title":"Hook, Line, and Sinker","author":"Tessa Bailey","description":"King crab fisherman Fox Thornton has a reputation as a sexy, carefree flirt. Everyone knows he's a guaranteed good time--in bed and out--and that's exactly how he prefers it. Until he meets Hannah Bellinger. She's immune to his charm and looks, but she seems to enjoy his... personality? And wants to be friends? Bizarre. But he likes her too much to risk a fling, so platonic pals it is.Now, Hannah's in town for work, crashing in Fox's spare bedroom. She knows he's a notorious ladies' man, but they're definitely just friends. In fact, she's nursing a hopeless crush on a colleague and Fox is just the person to help with her lackluster love life. Armed with a few tips from Westport's resident Casanova, Hannah sets out to catch her coworker's eye... yet the more time she spends with Fox, the more she wants him instead. As the line between friendship and flirtation begins to blur, Hannah can't deny she loves everything about Fox, but she refuses to be another notch on his bedpost.Living with his best friend should have been easy. Except now she's walking around in a towel, sleeping right across the hall, and Fox is fantasizing about waking up next to her for the rest of his life and... and... man overboard! He's fallen for her, hook, line, and sinker. Helping her flirt with another guy is pure torture, but maybe if Fox can tackle his inner demons and show Hannah he's all in, she'll choose him instead?In the follow-up to It Happened One Summer, Tessa Bailey delivers another deliciously fun rom-com about a former player who accidentally falls for his best friend while trying to help her land a different man...","img":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1627068858i/58283080.jpg"},{"title":"Part of Your World","author":"Abby Jimenez","description":"After a wild bet, gourmet grilled-cheese sandwich, and cuddle with a baby goat, Alexis Montgomery has had her world turned upside down. The cause: Daniel Grant, a ridiculously hot carpenter who’s ten years younger than her and as casual as they come—the complete opposite of sophisticated city-girl Alexis. And yet their chemistry is undeniable.While her ultra-wealthy parents want her to carry on the family legacy of world-renowned surgeons, Alexis doesn’t need glory or fame. She’s fine with being a “mere” ER doctor. And every minute she spends with Daniel and the tight-knit town where he lives, she’s discovering just what’s really important. Yet letting their relationship become anything more than a short-term fling would mean turning her back on her family and giving up the opportunity to help thousands of people.Bringing Daniel into her world is impossible, and yet she can’t just give up the joy she’s found with him either. With so many differences between them, how can Alexis possibly choose between her world and his?The New York Times bestselling author of Life's Too Short delivers a refreshingly modern fairy tale perfect for fans of Casey McQuiston and Emily Henry.","img":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1634649284i/58684524.jpg"},{"title":"You Made a Fool of Death with Your Beauty","author":"Akwaeke Emezi","description":"New York Times\n bestselling author and National Book Award finalist Akwaeke Emezi (they/them) reimagines the love story in this fresh and seductive novel about a young woman seeking joy while healing from loss.Feyi Adekola wants to learn how to be alive again. It’s been five years since the accident that killed the love of her life and she’s almost a new person now—an artist with her own studio, and sharing a brownstone apartment with her ride-or-die best friend, Joy, who insists it’s time for Feyi to ease back into the dating scene. Feyi isn’t ready for anything serious, but a steamy encounter at a rooftop party cascades into a whirlwind summer she could have never imagined: a luxury trip to a tropical island, decadent meals in the glamorous home of a celebrity chef, and a major curator who wants to launch her art career. She’s even started dating the perfect guy, but their new relationship might be sabotaged before it has a chance by the dangerous thrill Feyi feels every time she locks eyes with the one person in the house who is most definitely off-limits. This new life she asked for just got a lot more complicated, and Feyi must begin her search for real answers. Who is she ready to become? Can she release her past and honor her grief while still embracing her future? And, of course, there’s the biggest question of all—how far is she willing to go for a second chance at love?Akwaeke Emezi’s vivid and passionate writing takes us deep into a world of possibility and healing, and the constant bravery of choosing love against all odds.","img":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1651419815i/59232998.jpg"},{"title":"Electric Idol","author":"Katee Robert","description":"He was the most beautiful man alive.And if I wasn't careful, he was going to be my death.*A scorchingly hot modern retelling of Psyche and Eros that's as sinful as it is sweet.*In the ultra-modern city of Olympus, there's always a price to pay. Psyche knew she'd have to face Aphrodite's ire eventually, but she never expected her literal heart to be at stake...or for Aphrodite's gorgeous son to be the one ordered to strike the killing blow.Eros has no problem shedding blood. But when it comes time to take out his latest target, he can't do it. Confused by his reaction to Psyche, he does the only thing he can think of to keep her safe: he marries her. Psyche vows to make Eros's life a living hell until they find a way out of this mess. But as lines blur and loyalties shift, she realizes he might take her heart after all...and she's not sure she can survive the loss.","img":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1629300986i/57661359.jpg"},{"title":"The Bodyguard","author":"Katherine Center","description":"She’s got his back.\nHannah Brooks looks more like a kindergarten teacher than somebody who could kill you with a wine bottle opener. Or a ballpoint pen. Or a dinner napkin. But the truth is, she’s an Executive Protection Agent (aka \"bodyguard\"), and she just got hired to protect superstar actor Jack Stapleton from his middle-aged, corgi-breeding stalker.\n  He’s got her heart.\nJack Stapleton’s a household name—captured by paparazzi on beaches the world over, famous for, among other things, rising out of the waves in all manner of clingy board shorts and glistening like a Roman deity. But a few years back, in the wake of a family tragedy, he dropped from the public eye and went off the grid.\n  They’ve got a secret.\nWhen Jack’s mom gets sick, he comes home to the family’s Texas ranch to help out. Only one catch: He doesn’t want his family to know about his stalker. Or the bodyguard thing. And so Hannah—against her will and her better judgment—finds herself pretending to be Jack’s girlfriend as a cover. Even though her ex, like a jerk, says no one will believe it.\n  What could possibly go wrong???\nHannah hardly believes it, herself. But the more time she spends with Jack, the more real it all starts to seem. And there lies the heartbreak. Because it’s easy for Hannah to protect Jack. But protecting her own, long-neglected heart? That’s the hardest thing she’s ever done.","img":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1637059607i/58724801.jpg"},{"title":"The American Roommate Experiment","author":"Elena  Armas","description":"From the author of the Goodreads Choice Award winner The Spanish Love Deception, the eagerly anticipated follow-up featuring Rosie Graham and Lucas Martín, who are forced to share a New York apartment.Rosie Graham has a problem. A few, actually. She just quit her well paid job to focus on her secret career as a romance writer. She hasn’t told her family and now has terrible writer’s block. Then, the ceiling of her New York apartment literally crumbles on her. Luckily she has her best friend Lina’s spare key while she’s out of town. But Rosie doesn’t know that Lina has already lent her apartment to her cousin Lucas, who Rosie has been stalking—for lack of a better word—on Instagram for the last few months. Lucas seems intent on coming to her rescue like a Spanish knight in shining armor. Only this one strolls around the place in a towel, has a distracting grin, and an irresistible accent. Oh, and he cooks.Lucas offers to let Rosie stay with him, at least until she can find some affordable temporary housing. And then he proposes an outrageous experiment to bring back her literary muse and meet her deadline: He’ll take her on a series of experimental dates meant to jump-start her romantic inspiration. Rosie has nothing to lose. Her silly, online crush is totally under control—but Lucas’s time in New York has an expiration date, and six weeks may not be enough, for either her or her deadline.","img":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1660147951i/60114057.jpg"},{"title":"Funny You Should Ask","author":"Elissa Sussman","description":"Then. Twentysomething writer Chani Horowitz is stuck. While her former MFA classmates are nabbing book deals, she's in the trenches writing puff pieces. Then she's hired to write a profile of movie star Gabe Parker. The Gabe Parker--her forever celebrity crush, the object of her fantasies, the background photo on her phone--who's also just been cast as the new James Bond. It's terrifying and thrilling all at once... yet if she can keep her cool and nail the piece, it could be a huge win. Gabe will get good press, and her career will skyrocket. But what comes next proves to be life-changing in ways Chani never saw coming, as the interview turns into a whirlwind weekend that has the tabloids buzzing.Now. Ten years later, after a brutal divorce and a heavy dose of therapy, Chani is back in Los Angeles, laser-focused on one thing: her work. But she's still spent the better part of the last decade getting asked about her deeply personal Gabe Parker profile at every turn. No matter what new essay collection or viral editorial she's promoting, it always comes back to Gabe. So when his PR team requests that they reunite for a second interview, she wants to say no. She wants to pretend that she's forgotten about the time they spent together, years ago. But the truth is that those seventy-two hours are still crystal clear, etched in her memory. And so... he says yes.Chani knows that facing Gabe again also means facing feelings she's tried so hard to push away. Alternating between their first meeting and their reunion a decade later, this deliciously irresistible novel will have you hanging on until the last word.\n  A restless young journalist with big dreams interviews a Hollywood heartthrob--and, ten years later, it's clear that their time together meant more than meets the eye in this sexy, engrossing adult debut novel.","img":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1671712456i/58065414.jpg"},{"title":"Thank You for Listening","author":"Julia Whelan","description":"For Sewanee Chester, being an audiobook narrator is a long way from her old dreams, but the days of being a star on film sets are long behind her. She’s found success and satisfaction from the inside of a sound booth and it allows her to care for her beloved, ailing grandmother. When she arrives in Las Vegas last-minute for a book convention, Sewanee unexpectedly spends a whirlwind night with a charming stranger. On her return home, Sewanee discovers one of the world’s most beloved romance novelists wanted her to perform her last book—with Brock McNight, the industry’s hottest, most secretive voice. Sewanee doesn’t buy what romance novels are selling—not after her own dreams were tragically cut short—and she stopped narrating them years ago. But her admiration of the late author, and the opportunity to get her grandmother more help, makes her decision for her. As Sewanee begins work on the book, resurrecting her old romance pseudonym, she and Brock forge a real connection, hidden behind the comfort of anonymity. Soon, she is dreaming again, but secrets are revealed, and the realities of life come crashing down around her once more.If she can learn to risk everything for desires she has long buried, she will discover a world of intimacy and acceptance she never believed would be hers.From the author of My Oxford Year, Julia Whelan’s uplifting novel tells the story of a former actress turned successful audiobook narrator—who has lost sight of her dreams after a tragic accident—and her journey of self-discovery, love, and acceptance when she agrees to narrate one last romance novel.","img":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1652105760i/59314703.jpg"},{"title":"The Kiss Curse","author":"Erin Sterling","description":"Welcome to Spooky Season!! The follow-up to Erin Sterling’s New York Times bestselling hit The Ex Hex features fan favorite Gwyn and the spine-tinglingly handsome Wells Penhallow as they battle a new band of witches and their own magical chemistry.Gwyn Jones is perfectly happy with her life in Graves Glen. She, her mom, and her cousin have formed a new and powerful coven; she’s running a successful witchcraft shop, Something Wicked; and she’s started mentoring some of the younger witches in town. As Halloween approaches, there’s only one problem—Llewellyn “Wells” Penhallow.Wells has come to Graves Glen to re-establish his family’s connection to the town they founded as well as to make a new life for himself after years of being the dutiful son in Wales. When he opens up a shop of his own, Penhallow’s, just across the street from Something Wicked, he quickly learns he’s gotten more than he bargained for in going up against Gwyn.When their professional competition leads to a very personal—and very hot—kiss, both Wells and Gwyn are determined to stay away from each other, convinced the kiss was just a magical fluke. But when a mysterious new coven of witches come to town and Gwyn’s powers begin fading, she and Wells must work together to figure out just what these new witches want and how to restore Gwyn’s magic before it’s too late.","img":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1647103771i/59949720.jpg"},{"title":"Dating Dr. Dil","author":"Nisha Sharma","description":"Dating Dr. Dil features a love-phobic TV doctor who must convince a love-obsessed homebody they are destined to be together. Kareena Mann dreams of having a love story like her parents, but she prefers restoring her classic car to swiping right on dating apps. When her father announces he’s selling her mother’s home, Kareena makes a deal with him: he’ll gift her the house if she can get engaged in four months. Her search for her soulmate becomes impossible when her argument with Dr. Prem Verma, host of The Dr. Dil Show, goes viral. Now the only man in her life is the one she doesn’t want.Dr. Prem Verma is dedicated to building a local community health center, but he needs to get donors with deep pockets. The Dr. Dil Show was doing just that, until his argument with Kareena went viral, and he’s left short changed. That’s when Kareena’s meddling aunties presented him with a solution: convince Kareena he’s her soulmate and they’ll fund his clinic.  Even though they have conflicting views on love-matches and arranged-matches, the more time Prem spends with Kareena, the more he begins to believe she’s the woman he wants to spend the rest of his life with. But for Prem and Kareena to find their happily ever after, they must admit that hate has turned into fate.","img":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1642405300i/57007401.jpg"},{"title":"The Wedding Crasher","author":"Mia Sosa","description":"The USA Today bestselling author of The Worst Best Man is back with another hilarious rom-com about two strangers who get trapped in a lie and have to fake date their way out of it...Just weeks away from ditching DC for greener pastures, Solange Pereira is roped into helping her wedding planner cousin on a random couple’s big day. It’s an easy gig... until she stumbles upon a situation that convinces her the pair isn’t meant to be. What’s a true-blue romantic to do? Crash the wedding, of course. And ensure the unsuspecting groom doesn’t make the biggest mistake of his life.Dean Chapman had his future all mapped out. He was about to check off “start a family” and on track to “make partner” when his modern day marriage of convenience went up in smoke. Then he learns he might not land an assignment that could be his ticket to a promotion unless he has a significant other and, in a moment of panic, Dean claims to be in love with the woman who crashed his wedding. Oops.Now Dean has a whole new item on his to-do list: beg Solange to be his pretend girlfriend. Solange feels a tiny bit bad about ruining Dean’s wedding, so she agrees to play along. Yet as they fake-date their way around town, what started as a performance for Dean’s colleagues turns into a connection that neither he nor Solange can deny. Their entire romance is a sham... there’s no way these polar opposites could fall in love for real, right?","img":"https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1627893250i/55506996.jpg"}]}